Repository: MangaD/hf-workshop
Catalog: resources/languages/*/hfworkshop.po
Languages: de, pt

source: NOT
de: NICHT
pt: NÃO

source: as much as possible so that the final file will not be too large.
de: zu halten, damit die endgültige Datei nicht zu groß wird.
pt: tanto quanto possível para que o ficheiro final não seja muito grande.

source: of 5512 Hz, 11025 Hz, 22050 Hz and 44100 Hz are allowed (note: sample rates and bit rates are not the same thing). This program will tell you if the MP3 file that you're trying to replace with doesn't meet the requirements. In this case, you may find a converter online for your MP3 file. It is also recommended that you find an MP3 compressor to reduce the size of your MP3 files.
de: 5512 Hz, 11025 Hz, 22050 Hz und 44100 Hz sind zulässig (Samplerate und Bitrate sind nicht die selben Sachen!). Sollten die Anforderungen beim Ersetzen nicht stimmen, wird eine Fehlermeldung ausgegeben. In diesem Fall können Sie mit einem Online-Konverter ihre MP3-Datei ändern. Es wird auch empfohlen, einen MP3-Kompressor zu finden, um die Größe ihrer MP3-Dateien zu reduzieren.
pt: de 5512 Hz, 11025 Hz, 22050 Hz e 44100 Hz são permitidos (nota: sample rates e bit rates não são a mesma coisa). Este programa informa se o ficheiro MP3 não cumpre os requisitos. Nesse caso, poderás procurar um conversor online para o ficheiro MP3. É também recomendado o uso de um compressor de MP3 para reduzir o tamanho do ficheiro.

source: Back
de: Zurück
pt: Voltar

source: Compression:
de: Kompression:
pt: Compressão:

source: Data ID:
pt: ID do ficheiro de dados:

source: Data file with ID=%zu not found inside the game.
de: Data-Datei mit ID=%zu konnte nicht im Spiel gefunden werden.
pt: Ficheiro de dados com ID=%zu não foi encontrado no jogo.

source: Edit data
de: Data bearbeiten
pt: Editar dados

source: Edit images
de: Bilder bearbeiten
pt: Editar imagens

source: Edit sounds
de: Sounds bearbeiten
pt: Editar áudio

source: Edit stages
de: Stages bearbeiten
pt: Editar histórias

source: Error for data file with ID=%zu: %s
de: Fehler für die Data-Datei mit ID=%zu: %s
pt: Erro no ficheiro de dados com ID=%zu: %s

source: Error for data file with ID=%zu: File type unrecognized.
de: Fehler für die Data-Datei mit ID=%zu: Dateiformat wurde nicht erkannt.
pt: Erro no ficheiro de dados com ID=%zu: Tipo de ficheiro não reconhecido.

source: Error for data file with ID=%zu: Not an AMF3 ByteArray.
de: Fehler für die Data-Datei mit ID=%zu: keine AMF3 ByteArray.
pt: Erro no ficheiro de dados com ID=%zu: Não é um ByteArray de AMF3.

source: Error for image with ID=%zu: %s
de: Fehler für das Bild mit ID=%zu: %s
pt: Erro na imagem com ID=%zu: %s

source: Error for stage file with ID=%zu: %s
de: Fehler für die Stage mit ID=%zu: %s
pt: Erro no ficheiro de história com ID=%zu: %s

source: Error: %s
de: Fehler: %s
pt: Erro: %s

source: Exit
de: Beenden
pt: Sair

source: Export EXE
de: EXE exportieren
pt: Exportar EXE

source: Export SWF
de: SWF exportieren
pt: Exportar SWF

source: Export data file(s)
de: Data-Datei(en) exportieren
pt: Exportar ficheiro(s) de dados

source: Export image(s)
de: Bild(er) exportieren
pt: Exportar imagens

source: Export sound(s)
de: Sound(s) exportieren
pt: Exportar áudio

source: Export stage file(s)
de: Stage(s) exportieren
pt: Exportar história(s)

source: Exported %d data file(s).
de: %d Data-Datei(en) exportiert.
pt: %d ficheiro(s) de dados exportados.

source: Exported %d image(s).
de: %d Bild(er) exportiert.
pt: %d ficheiro(s) de imagem exportados.

source: Exported %d sound(s).
de: %d Sound(s) exportiert.
pt: %d ficheiro(s) de áudio exportados.

source: Exported %d stage file(s).
de: %d Stage(s) exportiert.
pt: %d história(s) exportada(s).

source: Exporting HF:
de: HF exportieren:
pt: Exportar o HF:

source: Exporting: %s
de: Exportieren: %s
pt: A exportar: %s

source: File path:
de: Dateipfad:
pt: Nome do ficheiro:

source: For tutorials and discussion visit
de: Für Tutorials und Diskussionen, besuche
pt: Para tutoriais e discussão, visitar

source: Generating %s... Please wait.
de: Generiere %s... Bitte warten.
pt: A gerar %s... Espere, por favor.

source: Generating SWF... Please wait.
de: Generiere SWF... Bitte warten.
pt: A gerar SWF... Espere, por favor.

source: Good bye. o/
de: Bye bye. o/
pt: Adeus! o/

source: Hello there, hero! Which file do you wish to modify?
de: Moin, Hero! Welche Datei wollen Sie bearbeiten?
pt: Olá, herói! Que ficheiro pretendes modificar?

source: Help
de: Hilfe
pt: Ajuda

source: Hero Fighter is property of Marti Wong. This game has suffered a lot at the hands of crackers, who sought to unlock all the characters in the game for free, thus making the game unsustainable. HF Workshop is meant to modify Hero Fighter in a ETHICAL manner in order to bring new wonders to the game. If you wish to see new Hero Fighter versions released in the future, by no means you'll attempt to modify this game in a way that hurts Marti's income or the game's reputation and its users. Keep in mind that sounds and images that you find on the internet might be copyright protected in which case you should
de: Dieses Spiel wurde von Crackern stark in Mitleidenschaft gezogen, die alle Charaktere des Spiels kostenlos freigeschalten haben, was das Spiel nicht nachhaltig machte. HF Werkstatt soll Hero Fighter auf eine ethische Weise das Modifizieren ermöglichen, um dem Spiel einen neuen Glanz zu verleihen. Wenn Sie in Zukunft neue Hero Fighter Versionen haben möchten, modifizieren Sie das Spiel keinenfalls so, dass Martis Einkommen, der Ruf des Spiels oder seiner Nutzer geschädigt werden. Beachten Sie, dass im Internet gefundene Sounds und Bilder möglicherweise urheberrechtlich geschützt sind. In diesem Fall sollten Sie diese
pt: O Hero Fighter é propriedade de Marti Wong. Este jogo sofreu bastante às mãos de crackers que procuraram desbloquear as personagens todas no jogo sem pagar, resultando na sua insustentabilidade. Este programa tem como objectivo modificar o Hero Fighter de forma ética, a fim de introduzir novas maravilhas no jogo. Se gostarias de ver novas versões do jogo, por favor não utilizes este programa de forma que prejudique a receita do autor ou a reputação do jogo e dos seus jogadores. Tem em atenção que sons e imagens que encontrares na internet poderão estar protegidos por direitos de autor e nesse caso

source: IMPORTANT:
de: WICHTIG:
pt: IMPORTANTE:

source: If you're using a Flash Player projector (i.e. an EXE file) it is recommended that you compress it using UPX.
de: Bei der Verwendung von "Flash Player Projector" (z.B. EXE-Dateien) ist eine UPX-Komprimierung erforderlich.
pt: Se usares o Flash Player projector (um ficheiro EXE), é recomendado que o comprimas com o UPX: https://upx.github.io/

source: Image ID:
de: Bild ID:
pt: ID da imagem:

source: Invalid input.
de: Ungültige Eingabe.
pt: Input inválido.

source: Invalid number.
de: Ungültige Nummer.
pt: Número inválido.

source: Invalid option.
de: Ungültige Option.
pt: Opção inválida.

source: List data files
de: Auflistung von Data-Dateien
pt: Listar ficheiros de dados

source: List images
de: Auflistung von Bildern
pt: Listar imagens

source: List sounds
de: Auflistung von Sounds
pt: Listar áudio

source: List stage files
de: Auflistung von Stages
pt: Listar histórias

source: No data file with ID=%zu.
de: Keine Data-Datei mit ID=%zu.
pt: Nenhum ficheiro de dados com ID=%zu.

source: No image with ID=%zu.
de: Keine Bild mit ID=%zu.
pt: Nenhuma imagem com ID=%zu.

source: No sound with ID=%zu.
de: Keine Sound mit ID=%zu.
pt: Nenhum ficheiro de áudio com ID=%zu.

source: No stage file with ID=%zu.
de: Keine Stage-Datei mit ID=%zu.
pt: Nenhuma história com ID=%zu.

source: Only MP3 files with
de: Nur MP3-Dateien mit
pt: Apenas ficheiros MP3 com

source: Only PNG files are supported. It is recommended that you resize and compress your PNG files. Note that images get slightly changed during the process of extracting and replacing due to premultiplied alpha.
de: Es werden nur PNG-Dateien unterschützt. Es ist notwendig, dass Sie sich um die Größe und Komprimierung ihrer PNG-Dateien kümmern.Beachten Sie, dass sich die Bilder während des Extrahierens und Ersetzens aufgrund des vormultiplizierten Alpha-Wertes geringfügig ändern.
pt: Apenas ficheiros PNG são suportados. É recomendado que redimensiones e comprimas os ficheiros PNG. Atenção que as imagens sofrem ligeiras alterações durante o processo de extracção e substituição, devido à pré-multiplicação do canal alfa.

source: Path to Adobe Flash Player Projector (default=SA.exe):
de: Pfad zum Adobe Flash Player Projector (Standard=SA.exe):
pt: Nome do Adobe Flash Player Projector (default=SA.exe):

source: Path to output file (default=HF_out.exe):
de: Pfad zur Ausgabedatei (Standard=HF_out.exe):
pt: Nome do ficheiro a guardar (default=HF_out.exe):

source: Path to output file (default=HF_out.swf):
de: Pfad zur Ausgabedatei (Standard=HF_out.swf):
pt: Nome do ficheiro a guardar (default=HF_out.swf):

source: Please do not change the format of the file name. It should be "BgInfoFile.json".
de: Bitte keine Veränderungen der Dateinamen. Es sollte "BgInfoFile.json" sein.
pt: Por favor não alteres o formato do nome do ficheiro. Deve ser "BgInfoFile.json".

source: Please do not change the format of the file name. It should be "Spt.json".
de: Bitte keine Veränderungen der Dateinamen. Es sollte "Spt.json" sein.
pt: Por favor não alteres o formato do nome do ficheiro. Deve ser "Spt.json".

source: Please do not change the format of the file names. They must start with "Attack_" or "PtWithName_" in case of .json files and be numbered accordingly to their order.
de: Bitte keine Veränderungen der Dateinamen vornehmen. json-Dateien müssen mit "Attack_" oder "PtWithName_" anfangen und entsprechend ihrer Ordnung nummeriert werden.
pt: Por favor não alteres o formato do nome do ficheiro. Devem começar com "Attack_" ou "PtWithName_" em caso de ficheiros .json e ser numerados de acordo com a sua ordem.

source: Please do not change the format of the file names. They must start with "LimbPic_" or "Limb_" in case of .json files and be numbered accordingly to their order.
de: Bitte keine Veränderungen der Dateinamen vornehmen. json-Dateien müssen mit "LimbPic_" oder "Limb_" anfangen und entsprechend ihrer Ordnung nummeriert werden.
pt: Por favor não alteres o formato do nome do ficheiro. Devem começar com "LimbPic_" ou "Limb_" em caso de ficheiros .json e ser numerados de acordo com a sua ordem.

source: Replace data file
de: Data-Datei ersetzen
pt: Substituir ficheiro de dados

source: Replace image
de: Bild ersetzen
pt: Substituir imagem

source: Replace sound
de: Sound ersetzen
pt: Substituir áudio

source: Replace stage file
de: Stage ersetzen
pt: Substituir história

source: Replacing '%s' with contents of file '%s'...
de: Ersetze '%s' durch den Inhalt von '%s'...
pt: A substituir '%s' com os conteúdos do ficheiro '%s'...

source: Replacing '%s' with file '%s'...
de: Ersetze '%s' durch die Datei '%s'...
pt: A substituir '%s' com o ficheiro '%s'...

source: Replacing Images:
de: Bilder ersetzen:
pt: Substituir imagens:

source: Replacing MP3:
de: MP3 ersetzen:
pt: Substituir MP3:

source: Sound ID:
pt: ID do áudio:

source: Sound with ID=%zu is not an MP3 file.
de: Sound mit ID=%zu ist keine MP3-Datei.
pt: Áudio com ID=%zu não é um ficheiro MP3.

source: Stage ID:
pt: ID da história:

source: Stage file with ID=%zu not found inside the game.
de: Stage mit ID=%zu konnte nicht im Spiel gefunden werden.
pt: História com ID=%zu não encontrada dentro do jogo.

source: This program allows you to list, export and replace images, sounds and stages. It is recommended that you keep the
de: Das Programm unterschützt das Auflisten, Exportieren und Ersetzen von Bildern, Sounds und Stages. Es wird empfohlen, die
pt: Este programa permite listar, exportar e substituir imagens, áudio e histórias. É recomendado que mantenhas

source: Tried to call export EXE without SWF being loaded.
de: Es wurde versucht, zu eine EXE-Datei zu exportieren, ohne dass die SWF-Datei geladen wurde.
pt: Tentou chamar export EXE sem o SWF estar carregado.

source: Tried to call export SWF without SWF being loaded.
de: Es wurde versucht, zu eine SWF-Datei zu exportieren, ohne dass die SWF-Datei geladen wurde.
pt: Tentou chamar export SWF sem o SWF estar carregado.

source: Tried to export data without SWF being loaded.
de: Es wurde versucht, Data-Datein zu exportieren, ohne dass die SWF-Datei geladen wurde.
pt: Tentou exportar dados sem o SWF estar carregado.

source: Tried to export images without SWF being loaded.
de: Es wurde versucht, Bilder zu exportieren, ohne dass die SWF-Datei geladen wurde.
pt: Tentou exportar imagens sem o SWF estar carregado.

source: Tried to export sounds without SWF being loaded.
de: Es wurde versucht, Sounds zu exportieren, ohne dass die SWF-Datei geladen wurde.
pt: Tentou exportar áudio sem o SWF estar carregado.

source: Tried to export stages without SWF being loaded.
de: Es wurde versucht, Stages zu exportieren, ohne dass die SWF-Datei geladen wurde.
pt: Tentou exportar histórias sem o SWF estar carregado.

source: Tried to list data without SWF being loaded.
de: Es wurde versucht, Data-Dateien aufzulisten, ohne dass eine SWF-Datei geladen wurde.
pt: Tentou listar dados sem o SWF estar carregado.

source: Tried to list stages without SWF being loaded.
de: Es wurde versucht, Stages aufzulisten, ohne dass eine SWF-Datei geladen wurde.
pt: Tentou listar histórias sem o SWF estar carregado.

source: Tried to list tags without SWF being loaded.
de: Es wurde versucht, Tags aufzulisten, ohne dass eine SWF-Datei geladen wurde.
pt: Tentou listar tags sem o SWF estar carregado.

source: Tried to replace a data file without SWF being loaded.
de: Es wurde versucht, eine Data-Datei zu ersetzen, ohne dass eine SWF-Datei geladen wurde.
pt: Tentou substituir um ficheiro de dados sem o SWF estar carregado.

source: Tried to replace a stage without SWF being loaded.
de: Es wurde versucht, eine Stage zu ersetzen, ohne dass eine SWF-Datei geladen wurde.
pt: Tentou substituir uma história sem o SWF estar carregado.

source: Tried to replace image without SWF being loaded.
de: Es wurde versucht, ein Bild zu ersetzen, ohne dass eine SWF-Datei geladen wurde.
pt: Tentou substituir uma imagem sem o SWF estar carregado.

source: Tried to replace sound without SWF being loaded.
de: Es wurde versucht, ein Sound zu ersetzen, ohne dass eine SWF-Datei geladen wurde.
pt: Tentou substituir um ficheiro de áudio sem o SWF estar carregado.

source: Type 'all' or comma separated IDs:
de: Geben Sie 'all' ein, oder durch Kommas getrennte IDs:
pt: Escreve 'all' ou IDs separados por vírgulas:

source: Unrecognized data file extension.
de: Unbekannte Dateiendung.
pt: Extensão de ficheiro de dados não reconhecido.

source: WARNING: LimbPic with ID=%d has "disabled" and "embeded" with the same value. This should not happen.
de: WARNUNG: LimbPic mit ID=%d besitzt für "disabled" und "embeded" den gleichen Wert. Dies sollte nicht passieren.
pt: AVISO: LimbPic com ID=%d tem "disabled" e "enabled" com o mesmo valor. Isto não é suposto acontecer.

source: WARNING: LimbPic with ID=%d has "embeded" set to "true", but there is no PNG file with that ID. If you wish to disable it, change "disabled" to "true" and "embeded" to "false".
de: WARNUNG: LimbPic mit ID=%d ist auf "true" gesetzt bei "embeded". Jedoch gibt es keine PNG-Datei mit der ID. Deaktiviert werden kann es durch das Setzen von "disabled" auf "true" und "embeded" auf "false".
pt: AVISO: LimbPic com ID=%d tem "embeded" a "true", mas não existe nenhum ficheiro PNG com esse ID. Se pretendes desactivá-lo, muda "disabled" para "true" e "embeded" para "false".

source: What do you wish to do?
de: Was wollen Sie tun?
pt: O que pretendes fazer?

source: Which MP3 file do you wish to replace with?
de: Mit welcher MP3-Datei möchten Sie es ersetzen?
pt: Com que ficheiro MP3 pretendes substituir?

source: Which MP3 sound do you wish to replace?
de: Welche MP3-Datei soll ersetzt werden?
pt: Que ficheiro MP3 pretendes substituir?

source: Which data file do you wish to replace with? (.zip)
de: Mit welcher Data-Datei möchten Sie es ersetzen? (.zip)
pt: Com que ficheiro de dados pretendes substituir?

source: Which data file do you wish to replace?
de: Welche Data-Datei soll ersetzt werden?
pt: Que ficheiro de dados pretendes substituir?

source: Which data file(s) do you wish to export?
de: Welche Data-Datei(en) sollen exportiert werden?
pt: Que ficheiro(s) de dados pretendes exportar?

source: Which image do you wish to replace?
de: Welches Bild soll ersetzt werden?
pt: Que imagem pretendes substituir?

source: Which image file do you wish to replace with?
de: Mit welchem Bild möchten Sie es ersetzen?
pt: Com que imagem pretendes substituir?

source: Which image(s) do you wish to export?
de: Welche Bild(er) sollen exportiert werden?
pt: Que imagens pretendes exportar?

source: Which sound(s) do you wish to export?
de: Welche Sound(s) sollen exportiert werden?
pt: Que ficheiro(s) de áudio pretendes exportar?

source: Which stage file do you wish to replace with? (.xml)
de: Mit welcher Stage möchen Sie es ersetzen? (.xml)
pt: Com que ficheiro de história pretendes substituir? (.xml)

source: Which stage file do you wish to replace?
de: Welche Stage soll ersetzt werden?
pt: Que história pretendes substituir?

source: Which stage(s) do you wish to export?
de: Welche Stage(s) sollen exportiert werden?
pt: Que história(s) pretendes exportar?

source: You have already loaded a Flash Player SA into memory. Would you like to use it? [y/n] (default=y):
de: Ein Flash Player SA ist bereits geladen. Soll dieser verwendet werden? [y/n] (Standard=y):
pt: Já tens carregado um Flash Player SA em memória. Queres usá-lo? [y/n] (default=y):

source: You have unsaved changes. Are you sure you want to exit without exporting SWF/EXE? [y/n] (default=n):
de: Sie haben Änderungen, die nicht gespeichert sind. Wollen Sie ohne Exportierung (SWF/EXE) HFW verlassen? [y/n] (Standard=n):
pt: Tens alterações não guardadas. Tens a certeza que queres sair sem exportar SWF/EXE? [y/n] (default=n):

source: You may export the modified Hero Fighter in SWF or EXE formats. When exporting, you'll be given the option to compress the SWF file using Zlib or LZMA algorithms. It is highly recommended that you use one of these because a smaller file size will be easier to transfer on the internet. Zlib compression is the most common, whilst LZMA is more recent and won't work on Flash Player versions below 11.
de: Sie können die bearbeitet Hero Fighter Version in SWF- oder EXE-Format exportieren. Beim Exportieren bekommen Sie die Optionen, die SWF-Datei mit Zlib oder LZMA zu komprimieren.Es wird dringend empfohlen eine dieser Möglichkeit zu wählen, da eine kleinere Datei einfacher ist über das Internet zu verschicken.Die Zlib-Komprimierung ist die am häufigste verwendete. LZMA ist neuer, dabei werden jedoch ältere Flash Player Versionen (unter v11) nicht unterschützt.
pt: Podes exportar o ficheiro de Hero Fighter modificado em formato SWF ou EXE. Ao exportar, será dada a opção de comprimir o ficheiro SWF usando os algoritmos Zlib ou LZMA. É recomendado que uses um deles porque um ficheiro mais pequeno é mais fácil de transferir na internet. Compressão Zlib é mais comum, enquanto que LZMA é mais recente e não funciona em versões de Flash Player inferiores a 11.

source: [0] Uncompressed [1] *zlib (faster, bigger) [2] LZMA (slower, smaller) Pick option (default=1):
de: [0] Unkomprimiert [1] *zlib (schneller, größer) [2] LZMA (langsamer, kleiner) Wähle eine Option (Standard=1):
pt: [0] Não comprimido [1] *zlib (mais rápido, maior) [2] LZMA (mais lento, menor) Escolhe uma opção (default=1):

source: images resized and sounds compressed
de: Größe der Bilder und Sounds so weit wie möglich komprimiert
pt: as imagens redimensionadas e sons comprimidos

source: use them. Thank you.
de: benutzen. Dankeschön.
pt: deves usá-los. Obrigado.

source: HF Workshop
de: HF Werkstatt

source: sample rates
de: Samplerate
